# Даны две переменные целого типа: A и B. Если их значения не равны, то присвоить
# каждой переменной сумму этих значений, а если равны, то присвоить переменным
# нулевые значения. Вывести новые значения переменных A и B

a = int(input("введите целове число №1: "))
b = int(input("введите целове число №2: "))

while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print("число введено неппраивльо")
        a = int(input("введите целове число №1: "))

while type(b) != int:
    try:
        b = int(b)
    except ValueError:
        print("число введено неппраивльо")
        b = int(input("введите целове число №2: "))

if a == b:
    a = 0
    b = 0
else:
    a = a+b
    b = a+b

print(a, b)